### Alineacion en objetos Series

In [1]:
import numpy as np
import pandas as pd

In [8]:
area = pd.Series({'Russia': 17075400, 'Canada':  9984670,
                  'USA': 9826675, 'China': 9598094, 
                  'Brazil': 8514877}, name='area')
population = pd.Series({'China': 1409517397, 'India': 1339180127,
                        'USA': 324459463, 'Indonesia': 322179605, 
                        'Brazil': 207652865}, name='population')
population_density=population/area
print(population_density)#NaN = Not a Number
df=pd.DataFrame({'area': area, 'population': population})
df['population density']=df['population']/df['area']
df

Brazil        24.387066
Canada              NaN
China        146.853885
India               NaN
Indonesia           NaN
Russia              NaN
USA           33.018235
dtype: float64

                 area    population  population density
Brazil      8514877.0  2.076529e+08           24.387066
Canada      9984670.0           NaN                 NaN
China       9598094.0  1.409517e+09          146.853885
India             NaN  1.339180e+09                 NaN
Indonesia         NaN  3.221796e+08                 NaN
Russia     17075400.0           NaN                 NaN
USA         9826675.0  3.244595e+08           33.018235

In [9]:
series1 = pd.Series([2, 4, 6], index=[0, 1, 2])
print(series1)
series2 = pd.Series([3, 5, 7], index=[1, 2, 3])
print(series2)
#Los indices se alinean y si no coinciden los indices al realziar una operacion entre objetos, estos serán Nan
series1 + series2

0    2
1    4
2    6
dtype: int64
1    3
2    5
3    7
dtype: int64

0     NaN
1     7.0
2    11.0
3     NaN
dtype: float64

### PAra evitar esto, usar el metodo add, que permite agregar un valor predeterminado a donde no lo hay, evitando así se siga expandiendo el NaN

In [10]:
series1.add(series2, fill_value=0)

0     2.0
1     7.0
2    11.0
3     7.0
dtype: float64

# Alineación de indices en objetos DataFrame

In [13]:
rng=np.random.RandomState(42)
df1 = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                   columns=list('AB')) #Se alinea con el index, tanto columnas como filas
df1

    A   B
0   6  19
1  14  10

In [14]:
df2 = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                   columns=list('BAC')) #se alinea con el index, tanto columnas como filas
df2

   B  A  C
0  7  4  6
1  9  2  6
2  7  4  3

In [18]:
fill=df1.stack().mean()
df1.add(df2, fill_value=fill)

       A      B      C
0  10.00  26.00  18.25
1  16.00  19.00  18.25
2  16.25  19.25  15.25

# Más operadores
Operador de Python	Métodos de Pandas

**+**	add()

**-**	sub(), subtract()

xd*xd	mul(), multiply()

**/**	truediv(), div(), divide()

**//**	floordiv()

**%**	mod()

xd**xd	pow()

In [19]:
df3 = pd.DataFrame(rng.randint(10, size=(3, 4)), columns=list('WXYZ'))
df3

   W  X  Y  Z
0  7  7  2  5
1  4  1  7  5
2  1  4  0  9

In [20]:
df3 - df3.iloc[0]

   W  X  Y  Z
0  0  0  0  0
1 -3 -6  5  0
2 -6 -3 -2  4

In [21]:
df3.subtract(df3['X'], axis=0)

   W  X  Y  Z
0  0  0 -5 -2
1  3  0  6  4
2 -3  0 -4  5

In [22]:
halfrow = df3.iloc[0, ::2] #se traspone este valor
halfrow

W    7
Y    2
Name: 0, dtype: int32

In [23]:
df3 - halfrow

     W   X    Y   Z
0  0.0 NaN  0.0 NaN
1 -3.0 NaN  5.0 NaN
2 -6.0 NaN -2.0 NaN